Revit 2027 API
ISaveSharedCoordinatesCallbackForUnloadLocally Interface
 An interface that is used to control Revit when trying to unload locally a Revit link with changes in shared coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ISaveSharedCoordinatesCallbackForUnloadLocally
Public Interface ISaveSharedCoordinatesCallbackForUnloadLocally
public interface class ISaveSharedCoordinatesCallbackForUnloadLocally
type ISaveSharedCoordinatesCallbackForUnloadLocally = interface end
The ISaveSharedCoordinatesCallbackForUnloadLocally type exposes the following members.
Methods
Name | Description
GetSaveModifiedLinksOptionForUnloadLocally |  Determines whether Revit should save the link or not prior to unloading the link locally.
Top
See Also
Reference
Autodesk.Revit.DB Namespace